import apifyImage from '../assets/images/apify.png'
import type { IPortfolioData } from './types'

export const portfolioData: IPortfolioData[] = [
	{
		title: 'Apify - тестирование API',
		description:
			'Apify — это удобный веб-сервис, позволяющий тестировать REST API прямо в браузере без установки дополнительных программ. Платформа выступает полноценным аналогом популярных настольных инструментов вроде Insomnia или Postman. Пользователь может создавать запросы любого типа, задавать заголовки, параметры, тело и сразу получать ответ от сервера. Интерфейс поддерживает сохранение коллекций, историю обращений и быстрый просмотр результатов. Также есть возможность делиться настройками с коллегами сети.',
		image: apifyImage,
		url: 'https://apify-fetchapi.web.app/'
	},
	{
		title: 'Poland24 - тестирование API',
		description:
			'Poland24 — це зручний веб-сервіс, який дозволяє швидко та комфортно замовляти різноманітні товари з іноземних інтернет-магазинів без складних процедур і зайвих кроків. Користувач може обирати товари, вводити свої дані, підтверджувати замовлення та відстежувати його статус. Інтерфейс інтуїтивний навіть для новачків, платформа автоматизує процес доставки, зберігає історію замовлень, дозволяє ділитися налаштуваннями з іншими користувачами. Основна мета — зробити шопінг за кордоном максимально зрозумілим, швидким і доступним для кожного.',
		url: 'https://www.youtube.com/watch?v=mPLjqicDwOc'
	}
]
